Rothezee/esp32_project/esp32_eeprom_optimized/main.cpp
/*
ESP32 Grúa Controller - Versión EEPROM Optimizada 2025
Características principales:
- Uso de EEPROM en lugar de Preferences para mayor estabilidad
- Arquitectura modular y mantenible
- Manejo robusto de WiFi con reconexión automática
- Sistema de heartbeat confiable
- Gestión eficiente de memoria y energía
- Manejo de errores mejorado
- Watchdog timer para prevenir cuelgues
- Escrituras inteligentes a EEPROM (solo cuando hay cambios)
- Código más legible y documentado
- Compatible con ESP32 Arduino Core v2.x y v3.x
*/

#include <Arduino.h>
#include <WiFi.h>
#include <HTTPClient.h>
#include <ArduinoJson.h>
#include <EEPROM.h>
#include <Wire.h>
#include <LiquidCrystal_I2C.h>

// Incluir watchdog solo si está disponible
#if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 2
  #include <esp_task_wdt.h>
  #define WATCHDOG_AVAILABLE
#endif

// ==================== CONFIGURACIÓN ====================
struct Config {
    // Identificación del dispositivo
    static constexpr const char* DEVICE_ID = "ESP32_005";
    
    // Configuración WiFi
    static constexpr const char* WIFI_SSID = "MOVISTAR-WIFI6-0160";
    static constexpr const char* WIFI_PASSWORD = "46332714";
    
    // URLs del servidor
    static constexpr const char* SERVER_DATA_URL = "https://maquinasbonus.com/esp32_project/insert_data.php";
    static constexpr const char* SERVER_HEARTBEAT_URL = "https://maquinasbonus.com/esp32_project/insert_heartbeat.php";
    
    // Configuración de pines
    static constexpr int PIN_TRIGGER = 13;
    static constexpr int PIN_ECHO = 12;
    static constexpr int PIN_DATO11 = 19;
    static constexpr int PIN_DATO7 = 14;
    static constexpr int PIN_DATO3 = 4;
    static constexpr int PIN_DATO5 = 25;
    static constexpr int PIN_EPINZA = 17;
    static constexpr int PIN_SPINZA = 16;
    static constexpr int PIN_DATO6 = 34;
    static constexpr int PIN_DATO10 = 35;
    static constexpr int PIN_DATO12 = 27;
    static constexpr int PIN_ECOIN = 26;
    
    // Configuración LCD
    static constexpr int LCD_ADDRESS = 0x27;
    static constexpr int LCD_COLUMNS = 16;
    static constexpr int LCD_ROWS = 2;
    
    // Intervalos de tiempo (ms)
    static constexpr unsigned long HEARTBEAT_INTERVAL = 60000;  // 1 minuto
    static constexpr unsigned long DATA_SEND_INTERVAL = 30000;  // 30 segundos
    static constexpr unsigned long WIFI_RECONNECT_INTERVAL = 30000;  // 30 segundos
    static constexpr unsigned long WATCHDOG_TIMEOUT = 30;  // 30 segundos
    static constexpr unsigned long EEPROM_SAVE_INTERVAL = 10000;  // 10 segundos
    
    // Configuración de la máquina
    static constexpr int BARRERA_THRESHOLD = 130;
    static constexpr int COIN_DEBOUNCE_COUNT = 5;
    static constexpr int PROGRAMMING_HOLD_TIME = 30;
    static constexpr int GAME_TIMEOUT_CYCLES = 18000;
    static constexpr int BARRIER_CHECK_CYCLES = 200;
    
    // Tamaño de EEPROM
    static constexpr int EEPROM_SIZE = 512;
};

// ==================== DIRECCIONES EEPROM ====================
struct EEPROMAddresses {
    static constexpr int INIT_FLAG = 0;        // 4 bytes
    static constexpr int COIN = 4;             // 4 bytes
    static constexpr int CONTSALIDA = 8;       // 4 bytes
    static constexpr int BANK = 12;            // 4 bytes
    static constexpr int PAGO = 16;            // 4 bytes
    static constexpr int TIEMPO = 20;          // 4 bytes
    static constexpr int FUERZA = 24;          // 4 bytes
    static constexpr int PJFIJO = 28;          // 4 bytes
    static constexpr int PPFIJO = 32;          // 4 bytes
    static constexpr int BARRERAAUX2 = 36;     // 4 bytes
    static constexpr int GRUADISPLAY = 40;     // 4 bytes
    static constexpr int TIEMPO5 = 44;         // 4 bytes
    static constexpr int CHECKSUM = 48;        // 4 bytes
};

// ==================== FUNCIONES DE WATCHDOG ====================
void initWatchdog() {
#ifdef WATCHDOG_AVAILABLE
    #if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
        // ESP32 Arduino Core 3.x
        esp_task_wdt_config_t wdt_config = {
            .timeout_ms = Config::WATCHDOG_TIMEOUT * 1000,
            .idle_core_mask = (1 << portNUM_PROCESSORS) - 1,
            .trigger_panic = true
        };
        esp_task_wdt_init(&wdt_config);
    #else
        // ESP32 Arduino Core 2.x
        esp_task_wdt_init(Config::WATCHDOG_TIMEOUT, true);
    #endif
    esp_task_wdt_add(NULL);
    Serial.println("Watchdog inicializado");
#else
    Serial.println("Watchdog no disponible en esta versión");
#endif
}

void resetWatchdog() {
#ifdef WATCHDOG_AVAILABLE
    esp_task_wdt_reset();
#endif
}

// ==================== CLASES Y ESTRUCTURAS ====================

class EEPROMManager {
private:
    static constexpr uint32_t INIT_VALUE = 0x12345678;  // Valor mágico para verificar inicialización
    
    uint32_t calculateChecksum() {
        uint32_t checksum = 0;
        for (int addr = EEPROMAddresses::COIN; addr < EEPROMAddresses::CHECKSUM; addr += 4) {
            uint32_t value;
            EEPROM.get(addr, value);
            checksum ^= value;
        }
        return checksum;
    }
    
    bool verifyChecksum() {
        uint32_t storedChecksum;
        EEPROM.get(EEPROMAddresses::CHECKSUM, storedChecksum);
        return storedChecksum == calculateChecksum();
    }
    
    void updateChecksum() {
        uint32_t checksum = calculateChecksum();
        EEPROM.put(EEPROMAddresses::CHECKSUM, checksum);
    }

public:
    bool initialize() {
        if (!EEPROM.begin(Config::EEPROM_SIZE)) {
            Serial.println("Error: No se pudo inicializar EEPROM");
            return false;
        }
        
        uint32_t initFlag;
        EEPROM.get(EEPROMAddresses::INIT_FLAG, initFlag);
        
        if (initFlag != INIT_VALUE || !verifyChecksum()) {
            Serial.println("Inicializando EEPROM con valores por defecto...");
            setDefaults();
            return true;
        }
        
        Serial.println("EEPROM inicializada correctamente");
        return true;
    }
    
