Rothezee/esp32_project/esp32_eeprom_optimized/main.cpp
    void setDefaults() {
        EEPROM.put(EEPROMAddresses::INIT_FLAG, INIT_VALUE);
        EEPROM.put(EEPROMAddresses::COIN, (uint32_t)0);
        EEPROM.put(EEPROMAddresses::CONTSALIDA, (uint32_t)0);
        EEPROM.put(EEPROMAddresses::BANK, (int32_t)0);
        EEPROM.put(EEPROMAddresses::PAGO, (int32_t)12);
        EEPROM.put(EEPROMAddresses::TIEMPO, (int32_t)2000);
        EEPROM.put(EEPROMAddresses::FUERZA, (int32_t)50);
        EEPROM.put(EEPROMAddresses::PJFIJO, (uint32_t)0);
        EEPROM.put(EEPROMAddresses::PPFIJO, (uint32_t)0);
        EEPROM.put(EEPROMAddresses::BARRERAAUX2, (int32_t)0);
        EEPROM.put(EEPROMAddresses::GRUADISPLAY, (int32_t)0);
        EEPROM.put(EEPROMAddresses::TIEMPO5, (int32_t)0);
        updateChecksum();
        EEPROM.commit();
    }
    
    template<typename T>
    T read(int address) {
        T value;
        EEPROM.get(address, value);
        return value;
    }
    
    template<typename T>
    void write(int address, T value) {
        EEPROM.put(address, value);
    }
    
    void commit() {
        updateChecksum();
        EEPROM.commit();
    }
    
    void resetCounters() {
        EEPROM.put(EEPROMAddresses::COIN, (uint32_t)0);
        EEPROM.put(EEPROMAddresses::CONTSALIDA, (uint32_t)0);
        EEPROM.put(EEPROMAddresses::BANK, (int32_t)0);
        EEPROM.put(EEPROMAddresses::PJFIJO, (uint32_t)0);
        EEPROM.put(EEPROMAddresses::PPFIJO, (uint32_t)0);
        commit();
    }
};

class WiFiManager {
private:
    unsigned long lastReconnectAttempt = 0;
    int reconnectAttempts = 0;
    static constexpr int MAX_RECONNECT_ATTEMPTS = 5;

public:
    bool connect() {
        WiFi.disconnect(true);
        delay(1000);
        
        Serial.println("Conectando a WiFi...");
        WiFi.begin(Config::WIFI_SSID, Config::WIFI_PASSWORD);
        
        int attempts = 0;
        while (WiFi.status() != WL_CONNECTED && attempts < 20) {
            delay(1000);
            Serial.print(".");
            attempts++;
            resetWatchdog(); // Reset watchdog
        }
        
        if (WiFi.status() == WL_CONNECTED) {
            Serial.println("\nWiFi conectado");
            Serial.print("IP: ");
            Serial.println(WiFi.localIP());
            reconnectAttempts = 0;
            return true;
        } else {
            Serial.println("\nError: No se pudo conectar a WiFi");
            return false;
        }
    }
    
    bool isConnected() {
        return WiFi.status() == WL_CONNECTED;
    }
    
    void handleReconnection() {
        if (!isConnected() && 
            (millis() - lastReconnectAttempt > Config::WIFI_RECONNECT_INTERVAL) &&
            reconnectAttempts < MAX_RECONNECT_ATTEMPTS) {
            
            lastReconnectAttempt = millis();
            reconnectAttempts++;
            Serial.printf("Intento de reconexión WiFi #%d\n", reconnectAttempts);
            connect();
        }
    }
};

class HTTPManager {
private:
    HTTPClient http;
    
public:
    bool sendData(const String& url, const JsonDocument& data) {
        if (WiFi.status() != WL_CONNECTED) {
            Serial.println("WiFi desconectado - no se pueden enviar datos");
            return false;
        }
        
        http.begin(url);
        http.addHeader("Content-Type", "application/json");
        http.setTimeout(10000); // 10 segundos timeout
        
        String payload;
        serializeJson(data, payload);
        
        int httpResponseCode = http.POST(payload);
        bool success = (httpResponseCode > 0 && httpResponseCode < 400);
        
        if (success) {
            Serial.printf("Datos enviados exitosamente. Código: %d\n", httpResponseCode);
        } else {
            Serial.printf("Error enviando datos. Código: %d\n", httpResponseCode);
        }
        
        http.end();
        return success;
    }
    
    bool sendHeartbeat() {
        JsonDocument doc;
        doc["device_id"] = Config::DEVICE_ID;
        return sendData(Config::SERVER_HEARTBEAT_URL, doc);
    }
    
    bool sendMachineData(int pesos, int coin, int premios, int banco) {
        JsonDocument doc;
        doc["device_id"] = Config::DEVICE_ID;
        doc["dato1"] = pesos;
        doc["dato2"] = coin;
        doc["dato3"] = premios;
        doc["dato4"] = banco;
        return sendData(Config::SERVER_DATA_URL, doc);
    }
};

class MachineData {
public:
    struct Counters {
        unsigned int coin = 0;
        unsigned int contsalida = 0;
        int bank = 0;
        int pago = 12;
        unsigned int pjfijo = 0;
        unsigned int ppfijo = 0;
    };
    
    struct Settings {
        int tiempo = 2000;
        int fuerza = 50;
        int tiempo5 = 0;
        int barreraaux2 = 0;
        int gruadisplay = 0;
    };
    
    Counters counters;
    Settings settings;
    
private:
    EEPROMManager* eepromManager;
    unsigned long lastSaveTime = 0;
    bool hasUnsavedChanges = false;
    
    // Variables para detectar cambios
    Counters lastSavedCounters;
    Settings lastSavedSettings;
    
public:
    bool initialize(EEPROMManager* eeprom) {
        eepromManager = eeprom;
        loadFromEEPROM();
        
        // Guardar estado inicial
        lastSavedCounters = counters;
        lastSavedSettings = settings;
        
        return true;
    }
    
    void loadFromEEPROM() {
        counters.coin = eepromManager->read<uint32_t>(EEPROMAddresses::COIN);
        counters.contsalida = eepromManager->read<uint32_t>(EEPROMAddresses::CONTSALIDA);
        counters.bank = eepromManager->read<int32_t>(EEPROMAddresses::BANK);
        counters.pago = eepromManager->read<int32_t>(EEPROMAddresses::PAGO);
        counters.pjfijo = eepromManager->read<uint32_t>(EEPROMAddresses::PJFIJO);
        counters.ppfijo = eepromManager->read<uint32_t>(EEPROMAddresses::PPFIJO);
        
        settings.tiempo = eepromManager->read<int32_t>(EEPROMAddresses::TIEMPO);
        settings.fuerza = eepromManager->read<int32_t>(EEPROMAddresses::FUERZA);
        settings.tiempo5 = eepromManager->read<int32_t>(EEPROMAddresses::TIEMPO5);
        settings.barreraaux2 = eepromManager->read<int32_t>(EEPROMAddresses::BARRERAAUX2);
        settings.gruadisplay = eepromManager->read<int32_t>(EEPROMAddresses::GRUADISPLAY);
    }
    
    bool hasChanges() {
        return (memcmp(&counters, &lastSavedCounters, sizeof(Counters)) != 0) ||
               (memcmp(&settings, &lastSavedSettings, sizeof(Settings)) != 0);
    }
    
    void markForSave() {
        hasUnsavedChanges = true;
    }
    
