Rothezee/esp32_project/esp32_eeprom_optimized/main.cpp
    void saveIfNeeded() {
        unsigned long currentTime = millis();
        
        // Guardar si hay cambios y ha pasado el tiempo mínimo
        if (hasUnsavedChanges && 
            (currentTime - lastSaveTime > Config::EEPROM_SAVE_INTERVAL)) {
            
            saveToEEPROM();
            hasUnsavedChanges = false;
            lastSaveTime = currentTime;
        }
    }
    
    void saveToEEPROM() {
        eepromManager->write(EEPROMAddresses::COIN, (uint32_t)counters.coin);
        eepromManager->write(EEPROMAddresses::CONTSALIDA, (uint32_t)counters.contsalida);
        eepromManager->write(EEPROMAddresses::BANK, (int32_t)counters.bank);
        eepromManager->write(EEPROMAddresses::PAGO, (int32_t)counters.pago);
        eepromManager->write(EEPROMAddresses::PJFIJO, (uint32_t)counters.pjfijo);
        eepromManager->write(EEPROMAddresses::PPFIJO, (uint32_t)counters.ppfijo);
        
        eepromManager->write(EEPROMAddresses::TIEMPO, (int32_t)settings.tiempo);
        eepromManager->write(EEPROMAddresses::FUERZA, (int32_t)settings.fuerza);
        eepromManager->write(EEPROMAddresses::TIEMPO5, (int32_t)settings.tiempo5);
        eepromManager->write(EEPROMAddresses::BARRERAAUX2, (int32_t)settings.barreraaux2);
        eepromManager->write(EEPROMAddresses::GRUADISPLAY, (int32_t)settings.gruadisplay);
        
        eepromManager->commit();
        
        // Actualizar estado guardado
        lastSavedCounters = counters;
        lastSavedSettings = settings;
        
        Serial.println("Datos guardados en EEPROM");
    }
    
    void forceSave() {
        saveToEEPROM();
        hasUnsavedChanges = false;
        lastSaveTime = millis();
    }
    
    void resetCounters() {
        counters.coin = 0;
        counters.contsalida = 0;
        counters.bank = 0;
        counters.pjfijo = 0;
        counters.ppfijo = 0;
        eepromManager->resetCounters();
        lastSavedCounters = counters;
    }
};

class DisplayManager {
private:
    LiquidCrystal_I2C lcd;
    
public:
    DisplayManager() : lcd(Config::LCD_ADDRESS, Config::LCD_COLUMNS, Config::LCD_ROWS) {}
    
    bool initialize() {
        lcd.init();
        lcd.backlight();
        return true;
    }
    
    void showCounters(const MachineData::Counters& counters, int bankTiempo) {
        lcd.clear();
        lcd.setCursor(0, 0);
        lcd.print("PJ:");
        lcd.setCursor(3, 0);
        lcd.print(counters.coin);
        lcd.setCursor(9, 0);
        lcd.print("PP:");
        lcd.setCursor(12, 0);
        lcd.print(counters.contsalida);
        lcd.setCursor(0, 1);
        lcd.print("PA:");
        lcd.setCursor(3, 1);
        lcd.print(counters.pago);
        lcd.setCursor(7, 1);
        lcd.print(bankTiempo);
        lcd.setCursor(9, 1);
        lcd.print("BK:");
        lcd.setCursor(12, 1);
        lcd.print(counters.bank);
    }
    
    void showCredit(int credito) {
        lcd.clear();
        lcd.setCursor(0, 0);
        lcd.print("Credito");
        lcd.setCursor(8, 0);
        lcd.print(credito);
    }
    
    void showBarrier() {
        lcd.setCursor(0, 1);
        lcd.print("###");
    }
    
    void showMessage(const String& line1, const String& line2 = "") {
        lcd.clear();
        lcd.setCursor(0, 0);
        lcd.print(line1);
        if (line2.length() > 0) {
            lcd.setCursor(0, 1);
            lcd.print(line2);
        }
    }
};

class SensorManager {
private:
    int referenceDistance = 0;
    
public:
    bool initialize() {
        // Calibrar sensor ultrasónico
        int measurements = 0;
        long totalDistance = 0;
        
        for (int i = 0; i < 10; i++) {
            int distance = readUltrasonicDistance();
            if (distance > 0 && distance < 4000) { // Filtrar lecturas inválidas
                totalDistance += distance;
                measurements++;
            }
            delay(50);
        }
        
        if (measurements > 0) {
            referenceDistance = totalDistance / measurements;
            Serial.printf("Distancia de referencia calibrada: %d\n", referenceDistance);
            return true;
        } else {
            Serial.println("Error: No se pudo calibrar el sensor ultrasónico");
            return false;
        }
    }
    
    int readUltrasonicDistance() {
        digitalWrite(Config::PIN_TRIGGER, LOW);
        delayMicroseconds(2);
        digitalWrite(Config::PIN_TRIGGER, HIGH);
        delayMicroseconds(10);
        digitalWrite(Config::PIN_TRIGGER, LOW);
        
        long duration = pulseIn(Config::PIN_ECHO, HIGH, 30000); // Timeout de 30ms
        if (duration == 0) return -1; // Timeout
        
        return duration / 10; // Conversión a distancia
    }
    
    bool isBarrierTriggered() {
        int currentDistance = readUltrasonicDistance();
        if (currentDistance < 0) return false; // Error de lectura
        
        return abs(currentDistance - referenceDistance) > Config::BARRERA_THRESHOLD;
    }
    
    bool isInfraredBarrierTriggered() {
        return digitalRead(Config::PIN_DATO7) == HIGH;
    }
    
    int getReferenceDistance() const {
        return referenceDistance;
    }
};

class CoinManager {
private:
    int auxCoin = 0;
    bool aux2Coin = false;
    
public:
    bool checkCoin() {
        bool coinDetected = false;
        
        // Debounce del sensor de monedas
        while (digitalRead(Config::PIN_ECOIN) == LOW && auxCoin < Config::COIN_DEBOUNCE_COUNT) {
            auxCoin++;
            delay(1);
            if (digitalRead(Config::PIN_ECOIN) == HIGH) auxCoin = 0;
        }
        
        if (auxCoin == Config::COIN_DEBOUNCE_COUNT && !aux2Coin) {
            coinDetected = true;
            aux2Coin = true;
        }
        
        while (digitalRead(Config::PIN_ECOIN) == HIGH && auxCoin > 0) {
            auxCoin--;
            delay(2);
            if (digitalRead(Config::PIN_ECOIN) == LOW) auxCoin = Config::COIN_DEBOUNCE_COUNT;
        }
        
        if (auxCoin == 0 && aux2Coin) aux2Coin = false;
        
        return coinDetected;
    }
};

