Rothezee/esp32_project/esp32_eeprom_optimized/main.cpp
// ==================== VARIABLES GLOBALES ====================
EEPROMManager eepromManager;
WiFiManager wifiManager;
HTTPManager httpManager;
MachineData machineData;
DisplayManager displayManager;
SensorManager sensorManager;
CoinManager coinManager;

// Variables de estado del juego
struct GameState {
    int credito = 0;
    unsigned int bankTiempo = 0;
    unsigned int cTiempo = 0;
    unsigned long tiempo7 = 0;
    unsigned long tiempo8 = 0;
    bool barrera = false;
    bool barreraAux = false;
    int auxDato3 = 0;
    unsigned long X = 0;
    
    // Variables para envío de datos
    struct {
        int prevPJFIJO = 0;
        int prevBANK = 0;
        int prevPPFIJO = 0;
        int prevPAGO = 0;
    } previous;
} gameState;

// Timers
unsigned long lastHeartbeat = 0;
unsigned long lastDataSend = 0;
unsigned long lastWiFiCheck = 0;

// ==================== FUNCIONES PRINCIPALES ====================

void setup() {
    Serial.begin(115200);
    Serial.println("=== ESP32 Grúa Controller v2.0 EEPROM ===");
    
    // Configurar watchdog
    initWatchdog();
    
    // Inicializar EEPROM
    if (!eepromManager.initialize()) {
        Serial.println("Error crítico en inicialización de EEPROM");
        ESP.restart();
    }
    
    // Inicializar componentes
    if (!initializeHardware()) {
        Serial.println("Error crítico en inicialización de hardware");
        ESP.restart();
    }
    
    if (!machineData.initialize(&eepromManager)) {
        Serial.println("Error crítico en inicialización de datos");
        ESP.restart();
    }
    
    if (!displayManager.initialize()) {
        Serial.println("Error crítico en inicialización de display");
        ESP.restart();
    }
    
    if (!sensorManager.initialize()) {
        Serial.println("Advertencia: Error en inicialización de sensores");
    }
    
    // Mostrar información inicial
    showInitialInfo();
    
    // Conectar WiFi
    wifiManager.connect();
    
    // Configurar PWM para la pinza
    analogWriteFrequency(Config::PIN_SPINZA, 100);
    
    // Inicializar display
    updateDisplay();
    
    Serial.println("Inicialización completada");
}

void loop() {
    resetWatchdog(); // Reset watchdog
    
    // Manejar reconexión WiFi
    wifiManager.handleReconnection();
    
    // Enviar heartbeat periódico
    handleHeartbeat();
    
    // Lógica principal del juego
    handleGameLogic();
    
    // Enviar datos si hay cambios
    handleDataTransmission();
    
    // Guardar datos en EEPROM si es necesario
    machineData.saveIfNeeded();
    
    delay(1); // Pequeña pausa para el watchdog
}

// ==================== FUNCIONES DE INICIALIZACIÓN ====================

bool initializeHardware() {
    // Configurar pines
    pinMode(Config::PIN_TRIGGER, OUTPUT);
    pinMode(Config::PIN_ECHO, INPUT);
    pinMode(Config::PIN_DATO7, INPUT_PULLUP);
    pinMode(Config::PIN_DATO5, OUTPUT);
    pinMode(Config::PIN_DATO3, INPUT_PULLUP);
    pinMode(Config::PIN_SPINZA, OUTPUT);
    pinMode(Config::PIN_EPINZA, INPUT_PULLUP);
    pinMode(Config::PIN_DATO11, OUTPUT);
    pinMode(Config::PIN_DATO6, INPUT_PULLUP);
    pinMode(Config::PIN_DATO10, INPUT_PULLUP);
    pinMode(Config::PIN_DATO12, INPUT_PULLUP);
    pinMode(Config::PIN_ECOIN, INPUT_PULLUP);
    
    // Inicializar salidas
    digitalWrite(Config::PIN_DATO11, HIGH);
    digitalWrite(Config::PIN_DATO5, LOW);
    analogWrite(Config::PIN_SPINZA, 0);
    
    return true;
}

void showInitialInfo() {
    displayManager.showMessage("VERSION 2.0", "EEPROM Optimized");
    delay(2000);
    
    // Mostrar contadores fijos si se presiona DATO3
    if (digitalRead(Config::PIN_DATO3) == LOW) {
        displayManager.showMessage("CONT.FIJOS", 
            "PJ:" + String(machineData.counters.pjfijo) + " PP:" + String(machineData.counters.ppfijo));
        delay(1000);
        while (digitalRead(Config::PIN_DATO3) == HIGH) { delay(20); }
    }
}

// ==================== FUNCIONES DE COMUNICACIÓN ====================

void handleHeartbeat() {
    if (millis() - lastHeartbeat >= Config::HEARTBEAT_INTERVAL) {
        lastHeartbeat = millis();
        
        if (wifiManager.isConnected()) {
            if (httpManager.sendHeartbeat()) {
                Serial.println("Heartbeat enviado exitosamente");
            } else {
                Serial.println("Error enviando heartbeat");
            }
        }
    }
}

void handleDataTransmission() {
    // Verificar si hay cambios en los datos importantes
    bool hasChanges = (
        machineData.counters.pjfijo != gameState.previous.prevPJFIJO ||
        machineData.counters.ppfijo != gameState.previous.prevPPFIJO ||
        machineData.counters.bank != gameState.previous.prevBANK ||
        machineData.counters.pago != gameState.previous.prevPAGO
    );
    
    if (hasChanges && wifiManager.isConnected()) {
        if (httpManager.sendMachineData(
            machineData.counters.pago,
            machineData.counters.pjfijo,
            machineData.counters.ppfijo,
            machineData.counters.bank
        )) {
            // Actualizar valores previos
            gameState.previous.prevPJFIJO = machineData.counters.pjfijo;
            gameState.previous.prevPPFIJO = machineData.counters.ppfijo;
            gameState.previous.prevBANK = machineData.counters.bank;
            gameState.previous.prevPAGO = machineData.counters.pago;
            
            // Marcar para guardar en EEPROM
            machineData.markForSave();
            
            Serial.println("Datos de máquina enviados exitosamente");
        }
    }
}

// ==================== LÓGICA DEL JUEGO ====================

void handleGameLogic() {
    // Esperar señal de pinza
    while (digitalRead(Config::PIN_EPINZA) == LOW && gameState.cTiempo < 5) {
        gameState.cTiempo++;
        
        // Leer monedas
        if (coinManager.checkCoin()) {
            gameState.credito++;
            updateDisplay();
        }
        
        // Verificar modo programación
        checkProgrammingMode();
        
