Rothezee/esp32_project/esp32_eeprom_optimized/main.cpp
        // Control de tiempo de juego
        handleGameTiming();
        
        // Verificar barrera periódicamente
        handleBarrierCheck();
        
        delay(1);
        resetWatchdog(); // Reset watchdog en el loop
    }
    
    // Procesar juego
    processGame();
}

void processGame() {
    gameState.barreraAux = false;
    gameState.cTiempo = 0;
    gameState.barrera = false;
    
    // Descontar crédito
    if (gameState.credito >= 1) {
        gameState.credito--;
    }
    
    updateDisplay();
    
    if (gameState.bankTiempo < 10) {
        gameState.bankTiempo++;
    }
    
    int randomValue = random(5);
    bool shouldWin = (machineData.counters.pago <= machineData.counters.bank && randomValue <= 3);
    
    if (shouldWin) {
        executeWinSequence();
    } else {
        executeLoseSequence();
    }
    
    // Incrementar contadores
    machineData.counters.coin++;
    machineData.counters.bank++;
    machineData.counters.pjfijo++;
    
    // Marcar para guardar
    machineData.markForSave();
    
    // Apagar pinza
    analogWrite(Config::PIN_SPINZA, 0);
    updateDisplay();
    
    // Reset variables
    gameState.tiempo8 = 0;
    gameState.X = 0;
}

void executeWinSequence() {
    Serial.println("Secuencia de victoria");
    analogWrite(Config::PIN_SPINZA, 250);
    delay(2000);
    
    waitForPinzaReturn();
}

void executeLoseSequence() {
    Serial.println("Secuencia de pérdida");
    
    // Cerrar pinza completamente
    analogWrite(Config::PIN_SPINZA, 255);
    delay(machineData.settings.tiempo5);
    
    // Ajustar fuerza según banco
    int adjustedForce = machineData.settings.fuerza;
    if (machineData.counters.bank <= -10) {
        adjustedForce = machineData.settings.fuerza * 0.8;
    }
    
    // Secuencia de aflojamiento progresivo
    executeProgressiveRelease(adjustedForce);
    
    waitForPinzaReturn();
}

void executeProgressiveRelease(int baseForce) {
    float currentForce = random(baseForce * 1.8, baseForce * 2.5);
    float forceDecrement = (currentForce - baseForce) / 10.0;
    int timeStep = machineData.settings.tiempo / 10;
    
    for (int i = 0; i <= 10; i++) {
        currentForce -= forceDecrement;
        analogWrite(Config::PIN_SPINZA, (int)currentForce);
        delay(timeStep);
        resetWatchdog(); // Reset watchdog
    }
    
    // Ajuste final
    analogWrite(Config::PIN_SPINZA, baseForce * 1.3);
    delay(300);
    analogWrite(Config::PIN_SPINZA, baseForce);
    delay(100);
    analogWrite(Config::PIN_SPINZA, baseForce * 1.3);
}

void waitForPinzaReturn() {
    bool waitingForReturn = true;
    
    while (waitingForReturn) {
        while (gameState.X < 3000) {
            if (digitalRead(Config::PIN_EPINZA) == HIGH) {
                gameState.X = 0;
            }
            
            if (gameState.X == 150) {
                analogWrite(Config::PIN_SPINZA, 0);
            }
            
            if (digitalRead(Config::PIN_EPINZA) == LOW) {
                gameState.X++;
                delay(1);
            }
            
            // Verificar barrera periódicamente
            if (gameState.tiempo8 <= 20) {
                gameState.tiempo8++;
            }
            if (gameState.tiempo8 >= 19) {
                gameState.tiempo8 = 0;
                if (!gameState.barreraAux) {
                    checkBarrier();
                }
            }
            
            if (gameState.X == 2998) {
                waitingForReturn = false;
            }
            
            if (gameState.barreraAux) {
                waitingForReturn = false;
                break;
            }
            
            resetWatchdog(); // Reset watchdog
        }
    }
}

// ==================== FUNCIONES DE BARRERA ====================

void handleBarrierCheck() {
    if (gameState.tiempo8 < Config::BARRIER_CHECK_CYCLES) {
        gameState.tiempo8++;
        if (gameState.tiempo8 == Config::BARRIER_CHECK_CYCLES - 1) {
            gameState.tiempo8 = 0;
            if (!gameState.barreraAux) {
                checkBarrier();
            }
        }
    }
}

void checkBarrier() {
    bool barrierTriggered = false;
    
    if (machineData.settings.barreraaux2 == 1) {
        // Sensor ultrasónico
        barrierTriggered = sensorManager.isBarrierTriggered();
    } else {
        // Sensor infrarrojo
        barrierTriggered = sensorManager.isInfraredBarrierTriggered();
    }
    
    if (barrierTriggered) {
        gameState.barrera = true;
        displayManager.showBarrier();
        delay(2500);
        updateDisplay();
        
        if (digitalRead(Config::PIN_DATO12) == HIGH) {
            machineData.counters.contsalida++;
            machineData.counters.ppfijo++;
            machineData.counters.bank -= machineData.counters.pago;
            gameState.barrera = false;
            gameState.barreraAux = true;
            machineData.markForSave();
            updateDisplay();
        }
    }
}

// ==================== FUNCIONES DE TEMPORIZACIÓN ====================

void handleGameTiming() {
    if (gameState.tiempo7 < 100000) {
        gameState.tiempo7++;
    }
    
    if (gameState.cTiempo >= Config::GAME_TIMEOUT_CYCLES && gameState.bankTiempo > 0) {
        gameState.cTiempo = 0;
        gameState.bankTiempo--;
    }
}

// ==================== FUNCIONES DE PROGRAMACIÓN ====================

void checkProgrammingMode() {
    if (digitalRead(Config::PIN_DATO3) == LOW) {
        gameState.auxDato3++;
    } else {
        gameState.auxDato3 = 0;
    }
    
    if (digitalRead(Config::PIN_DATO3) == LOW && gameState.auxDato3 == Config::PROGRAMMING_HOLD_TIME) {
        enterProgrammingMode();
        gameState.auxDato3 = 0;
    }
}

void enterProgrammingMode() {
    Serial.println("Entrando en modo programación");
    
    // Mostrar versión
    displayManager.showMessage("VERSION 2.0", "EEPROM Optimized");
    delay(500);
    while (digitalRead(Config::PIN_DATO3) == HIGH) { delay(20); }
    
    // Mostrar contadores fijos
    displayManager.showMessage("PJ:" + String(machineData.counters.pjfijo), 
                              "PP:" + String(machineData.counters.ppfijo));
    delay(500);
    while (digitalRead(Config::PIN_DATO3) == HIGH) { delay(20); }
    
    // Opción para borrar contadores
    programResetCounters();
    
