Rothezee/esp32_project/esp32_eeprom_optimized/main.cpp
    // Configurar modo de display
    programDisplayMode();
    
    // Configurar pago
    programPayment();
    
    // Configurar tiempo
    programTiming();
    
    // Configurar tiempo fuerza fuerte
    programStrongForceTime();
    
    // Configurar fuerza
    programForce();
    
    // Configurar tipo de barrera
    programBarrierType();
    
    // Probar barrera
    testBarrier();
    
    // Guardar cambios inmediatamente
    machineData.forceSave();
    
    updateDisplay();
    delay(500);
}

void programResetCounters() {
    bool resetCounters = false;
    displayManager.showMessage("BORRA CONTADORES", "NO");
    delay(500);
    
    while (digitalRead(Config::PIN_DATO3) == HIGH) {
        if (digitalRead(Config::PIN_DATO6) == LOW) {
            resetCounters = true;
            displayManager.showMessage("BORRA CONTADORES", "SI");
            delay(500);
        }
        if (digitalRead(Config::PIN_DATO10) == LOW) {
            resetCounters = false;
            displayManager.showMessage("BORRA CONTADORES", "NO");
            delay(500);
        }
        resetWatchdog();
    }
    
    if (resetCounters) {
        machineData.resetCounters();
        displayManager.showMessage("BORRADOS", "");
        delay(1000);
    }
}

void programDisplayMode() {
    displayManager.showMessage("Display Modo", 
        machineData.settings.gruadisplay == 0 ? "Contadores" : "Coin");
    delay(500);
    
    while (digitalRead(Config::PIN_DATO3) == HIGH) {
        if (digitalRead(Config::PIN_DATO6) == LOW) {
            machineData.settings.gruadisplay = 0;
            displayManager.showMessage("Display Modo", "Contadores");
            delay(200);
        }
        if (digitalRead(Config::PIN_DATO10) == LOW) {
            machineData.settings.gruadisplay = 1;
            displayManager.showMessage("Display Modo", "Coin");
            delay(200);
        }
        resetWatchdog();
    }
}

void programPayment() {
    displayManager.showMessage("AJUSTAR PAGO", "");
    delay(500);
    
    while (digitalRead(Config::PIN_DATO3) == HIGH) {
        displayManager.showMessage("AJUSTAR PAGO", String(machineData.counters.pago));
        delay(100);
        
        if (digitalRead(Config::PIN_DATO6) == LOW) {
            machineData.counters.pago++;
            delay(400);
        }
        if (digitalRead(Config::PIN_DATO10) == LOW) {
            machineData.counters.pago--;
            delay(400);
        }
        resetWatchdog();
    }
}

void programTiming() {
    displayManager.showMessage("AJUSTAR TIEMPO", "");
    delay(500);
    
    while (digitalRead(Config::PIN_DATO3) == HIGH) {
        displayManager.showMessage("AJUSTAR TIEMPO", String(machineData.settings.tiempo));
        delay(100);
        
        if (digitalRead(Config::PIN_DATO6) == LOW && machineData.settings.tiempo < 5000) {
            machineData.settings.tiempo += 10;
        }
        if (digitalRead(Config::PIN_DATO10) == LOW && machineData.settings.tiempo > 500) {
            machineData.settings.tiempo -= 10;
        }
        resetWatchdog();
    }
}

void programStrongForceTime() {
    displayManager.showMessage("TIEMPO F. FUERTE", "");
    delay(500);
    
    while (digitalRead(Config::PIN_DATO3) == HIGH) {
        displayManager.showMessage("TIEMPO F. FUERTE", String(machineData.settings.tiempo5));
        delay(100);
        
        if (digitalRead(Config::PIN_DATO6) == LOW && machineData.settings.tiempo5 < 5000) {
            machineData.settings.tiempo5 += 10;
        }
        if (digitalRead(Config::PIN_DATO10) == LOW && machineData.settings.tiempo5 > 0) {
            machineData.settings.tiempo5 -= 10;
        }
        resetWatchdog();
    }
}

void programForce() {
    displayManager.showMessage("AJUSTAR FUERZA", "");
    delay(500);
    
    while (digitalRead(Config::PIN_DATO3) == HIGH) {
        displayManager.showMessage("AJUSTAR FUERZA", String(machineData.settings.fuerza));
        delay(100);
        
        if (digitalRead(Config::PIN_DATO6) == LOW && machineData.settings.fuerza < 101) {
            machineData.settings.fuerza++;
        }
        if (digitalRead(Config::PIN_DATO10) == LOW && machineData.settings.fuerza > 5) {
            machineData.settings.fuerza--;
        }
        resetWatchdog();
    }
}

void programBarrierType() {
    displayManager.showMessage("TIPO BARRERA", 
        machineData.settings.barreraaux2 == 0 ? "INFRARROJO" : "ULTRASONIDO");
    delay(500);
    
    while (digitalRead(Config::PIN_DATO3) == HIGH) {
        if (digitalRead(Config::PIN_DATO6) == LOW) {
            machineData.settings.barreraaux2 = 0;
            displayManager.showMessage("TIPO BARRERA", "INFRARROJO");
            delay(200);
        }
        if (digitalRead(Config::PIN_DATO10) == LOW) {
            machineData.settings.barreraaux2 = 1;
            displayManager.showMessage("TIPO BARRERA", "ULTRASONIDO");
            delay(200);
        }
        resetWatchdog();
    }
}

void testBarrier() {
    displayManager.showMessage("PRUEBA BARRERA", "");
    delay(500);
    
    while (digitalRead(Config::PIN_DATO3) == HIGH) {
        int distance = sensorManager.readUltrasonicDistance();
        displayManager.showMessage("PRUEBA BARRERA", 
            String(distance) + " R:" + String(sensorManager.getReferenceDistance()));
        
        bool triggered = false;
        if (machineData.settings.barreraaux2 == 1) {
            triggered = sensorManager.isBarrierTriggered();
        } else {
            triggered = sensorManager.isInfraredBarrierTriggered();
        }
        
        if (triggered) {
            displayManager.showMessage("PRUEBA BARRERA", "###");
            delay(1000);
        }
        
        resetWatchdog();
        delay(100);
    }
}

// ==================== FUNCIONES DE DISPLAY ====================

void updateDisplay() {
    if (machineData.settings.gruadisplay == 0) {
        displayManager.showCounters(machineData.counters, gameState.bankTiempo);
    } else {
        displayManager.showCredit(gameState.credito);
    }
}